# 3.  Дано целое число в диапазоне 0 – 9. Вывести строку — название соответствующей цифры на русском языке (0 —
# "ноль", 1 — "один", 2 — "два", ...).
# 16.  Дано целое число в диапазоне 100 – 999. Вывести строку — словесное
# описание данного числа, например: 256 — "двести пятьдесят шесть", 814 — "восемьсот четырнадцать".

# Получить строковое представление числа
def get_string_digit_before9(value):
    if value < 0 or value > 9:
        return "Error"
    items = {0: "Ноль",
             1: "Один",
             2: "Два",
             3: "Три",
             4: "Четыре",
             5: "Пять",
             6: "Шесть",
             7: "Семь",
             8: "Восемь",
             9: "Девять"
             }
    return items[value].lower()


def get_string_digit_before999(value):
    if value > 999 or value < 100:
        return "Error"
    items_999 = {1: "Сто", 2: "Двести", 3: "Триста", 4: "Четыреста", 5: "Пятьсот", 6: "Шестьсот", 7: "Семьсот",
                 8: "Восемьсот", 9: "Девятьсот"}
    items_19 = {1: "Одиннадцать", 2: "Двенадцать", 3: "Тренадцать", 4: "четырнадцать", 5: "пятнадцать",
                6: "шестнадцать", 7: "семнадцать", 8: "восемнадцать", 9: "девятнадцать"}
    items_99 = {2: "Двадцать", 3: "Тридцать", 4: "Сорок", 5: "Пятьдесят",
                6: "Шестьдесят", 7: "Семьдесят", 8: "Восемьдесят", 9: "Девяносто"}
    items_9 = {1: "Один", 2: "Два", 3: "Три", 4: "Четыре", 5: "Пять", 6: "Шесть", 7: "Семь", 8: "Восемь", 9: "Девять"}

    resultList = [items_999[int(value / 100) % 10]]
    if int((value % 100) / 10) == 1:
        resultList.append(items_19[value % 100 % 10])
    else:
        resultList.append(items_99[int((value % 100)/ 10)])
        resultList.append(items_9[value % 100 % 10])
    return "".join(e + " " for e in resultList).lower()


print(get_string_digit_before9(int(input("Введите число от 0 - 9: "))))

print(get_string_digit_before999(int(input("Введите число от 100 - 999: "))))